//- Є змінна х, якій ви надаєте довільне числове значення.
// Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
// let x = +prompt('Ведіть числове значення');
// if (x != 0) {
//     console.log('Вірно');
// } else {
//     console.log('Не вірно');
// };

//- Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години
// let time=+prompt('Введіть число від 0 до 59');
// if (time>=0&&time<16){
//     console.log('1 чверть')
// }else if(time>=16&&time<31){
//     console.log('2 чверть')
// }else if(time>=31&&time<46){
//     console.log('3 чверть')
// }else if(time>=46&&time<60){
//     console.log('4 чверть')
// }else {
//     console.log(' Введіть коректне значення');
// }

//Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).
// switch (6) {
//     case 1:
//         console.log('Monday');
//         break;
//     case 2:
//         console.log('Tuesday');
//         break;
//     case 3:
//         console.log('Wednesday');
//         break;
//     case 4:
//         console.log('Thursday');
//         break;
//     case 5:
//         console.log('Friday');
//         break;
//     case 6:
//         console.log('Saturday');
//         break;
//     case 7:
//         console.log('Sanday');
//         break;
//     default:
//         console.log(' Введіть значення від 1 до 7');
// }

// Користувач вводить або має два числа.
// Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.
// let y=+prompt('Введіть числo y');
// let z=+prompt('Введіть числo x');
// if (y>z){
//     console.log(y)
// }else if(z>y){
//     console.log(z)
// }else if(z=y){
//     console.log(z)
// }else {console.log(' Введіть коректні значення');}

// - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//     за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)
// let a=confirm(""||NaN||null||undefined||0||false)? 'default': 'Введіть значення ще раз'
//     console.log(a);
